app/controllers/api/steps_controller.rb

  def index
    @steps = Step.where(todo_id: params[:todo_id])
---
SELECT "steps".* FROM "steps" WHERE "steps"."todo_id" = $1  [["todo_id", 3]]

  def create
    @step = Step.new(step_params)
    if @step.save
---
INSERT INTO "steps" ("title", "todo_id") VALUES ($1, $2) RETURNING "id"  [["title", "get bucket"], ["todo_id", 2]]

  def destroy
    @step = set_step
    if @step.destroy
---
DELETE FROM "steps" WHERE "steps"."id" = $1  [["id", 1]]

  def set_step
    Step.find(params[:id])
---
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]