app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body") VALUES ($1, $2) RETURNING "id"  [["title", "test"], ["body", "test"]]
---
  def create
    @todo = current_user.todos.new(title: todo_params[:title], body: todo_params[:body], isDone: todo_params[:isDone])
    unless todo_params[:tag_names].nil?
      @todo.tag_names = todo_params[:tag_names]
    end
    if @todo.save

UPDATE "todos" SET "isDone" = $1 WHERE "todos"."id" = $2  [["isDone", true], ["id", 1]]
---
  def update
    @todo = set_todo
    if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]
---
  def destroy
    @todo = set_todo
    if @todo.destroy

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_todo
    current_user.todos.find(params[:id])